{{----------------- NOT DEVELOPED YET -----------------}}
<div class="drop-down-list">
    <h2 class="title">Поки, не розроблені фічі:</h2>
    <div class="drop-down-list-content hide">
        <ul>
            <li>
                Обчислення загального, середнього рейтингу модифікації, на базі оцінок
                від користувачів.
            </li>
            <li>
                Підписка на модифікацію: тобто користувачу будуть приходити сповіщення
                про новини щодо даної модифікації. Тобіш просто слідкування за модом.
            </li>
            <li>
                Лічильник кількості переглядів даної модифікації
            </li>
            <br>
            <img src="{{ asset($pathToImages . "not_developed_1.png") }}" width="320" alt="not_developed_1">
        </ul>

        <hr><br><br>
    </div>
</div>