@extends('documentation.base')

@section('content')
    <h1>Unit-тести: перевірка функціоналу роботи з редактора зображень.</h1>

    <div>

        {{---------- FUNCTIONS LIST ----------}}
        <div>
            <h3>Список функцій-тестів:</h3>

            <ul>
                <li>
                    <span class="function-name">test_create_image_content_with_params()</span>
                    <p>
                        Перевірка створення модифікованого контенту зображення, на основі
                        якогось іншого зображення.<br>
                        Ми повинні самі задати необхідні параметри видозміни для цього
                        нового контенту, наприклад: ширина, висота, розширення.<br>
                        Потім, на основі цього контенту ми можемо створити файл із зображенням
                        та записати його на диск.
                    </p>
                </li>
            </ul>
        </div>

    </div>
@endsection