{{----------------------------------- UTILS ---------------------------------------}}

<div>
    <h2>Утиліти (utils):</h2>

    <ul>
        <li>
            <span class="function-name">test_clean_mods_images_dir</span>
            <p>
                Не є тестом сама по собі, але викликається як тест, адже
                після виконання усіх, вище перерахованих, тестів, необхідно
                очистити тимчасову папку із тестовими зображенням.
            </p>
        </li>
    </ul>
    <br><br><hr>
</div>